In [ ]:
## Workshop 9 Advanced Pandas Retail Chain Performance Analysis
### DAB JULY 2025 KM

In [3]:
# Import required libraries
import sqlite3

import pandas as pd  # Main library for data manipulation and analysis


import glob

#Get all CSV file paths from a folder
# perfer this method of bring in CSV files and re-naming 
csv_files = glob.glob("*.csv")

# Create a dictionary of DataFrames
dataframes = {file: pd.read_csv(file) for file in csv_files}

# Display the first few rows of each DataFrame
for file, df in dataframes.items():
    print(f"\n--- {file} ---")
    print(df.head())

--- products_wk9_thurs.csv ---
   product_id                   product_name           category  price  \
0           1  Wireless Bluetooth Headphones        Electronics  79.99
1           2         Organic Cotton T-Shirt           Clothing  24.99
2           3   Stainless Steel Water Bottle      Home & Garden  19.99
3           4          Leather Crossbody Bag        Accessories  89.99
4           5               Yoga Mat Premium  Sports & Outdoors  34.99

  launch_date       brand
0  2021-03-15   AudioTech
1  2021-04-20     EcoWear
2  2021-05-10   HydroLife
3  2021-06-01  StyleCraft
4  2021-06-15     FitZone

--- customers_wk9_thurs.csv ---
   customer_id first_name last_name  age state  income registration_date  \
0            1       John     Smith   34    CA   75000        2022-01-15
1            2      Sarah   Johnson   28    NY   82000        2022-01-22
2            3    Michael     Brown   45    TX   95000        2022-02-03
3            4      Emily     Davis   31    FL   68000        2022-02-14
4            5      David    Wilson   52    IL  110000        2022-02-28

                     email
0     john.smith@email.com
1  sarah.johnson@email.com
2  michael.brown@email.com
3    emily.davis@email.com
4   david.wilson@email.com

--- sales_wk9_thurs.csv ---
   sale_id  customer_id  product_id     transaction_date  quantity  \
0        1            1           1  2022-02-10 14:30:00         1
1        2            2           3  2022-02-15 10:15:00         2
2        3            3           5  2022-02-20 16:45:00         1
3        4            4           2  2022-02-25 11:20:00         3
4        5            5           4  2022-03-01 13:10:00         1

   total_amount
0         79.99
1         39.98
2         34.99
3         74.97
4         89.99

In [4]:
# See all keys (file names)
print(dataframes.keys())

dict_keys(['products_wk9_thurs.csv', 'customers_wk9_thurs.csv', 'sales_wk9_thurs.csv'])

In [5]:
# Rename each DataFrame to an easier variable name
products_df = dataframes["products_wk9_thurs.csv"]
customers_df = dataframes["customers_wk9_thurs.csv"]
sales_df = dataframes["sales_wk9_thurs.csv"]


# check first rows to make sure everything loaded correctly
print(products_df.head())
print(sales_df.head())
print(customers_df.head())

   product_id                   product_name           category  price  \
0           1  Wireless Bluetooth Headphones        Electronics  79.99
1           2         Organic Cotton T-Shirt           Clothing  24.99
2           3   Stainless Steel Water Bottle      Home & Garden  19.99
3           4          Leather Crossbody Bag        Accessories  89.99
4           5               Yoga Mat Premium  Sports & Outdoors  34.99

  launch_date       brand
0  2021-03-15   AudioTech
1  2021-04-20     EcoWear
2  2021-05-10   HydroLife
3  2021-06-01  StyleCraft
4  2021-06-15     FitZone
   sale_id  customer_id  product_id     transaction_date  quantity  \
0        1            1           1  2022-02-10 14:30:00         1
1        2            2           3  2022-02-15 10:15:00         2
2        3            3           5  2022-02-20 16:45:00         1
3        4            4           2  2022-02-25 11:20:00         3
4        5            5           4  2022-03-01 13:10:00         1

   total_amount
0         79.99
1         39.98
2         34.99
3         74.97
4         89.99
   customer_id first_name last_name  age state  income registration_date  \
0            1       John     Smith   34    CA   75000        2022-01-15
1            2      Sarah   Johnson   28    NY   82000        2022-01-22
2            3    Michael     Brown   45    TX   95000        2022-02-03
3            4      Emily     Davis   31    FL   68000        2022-02-14
4            5      David    Wilson   52    IL  110000        2022-02-28

                     email
0     john.smith@email.com
1  sarah.johnson@email.com
2  michael.brown@email.com
3    emily.davis@email.com
4   david.wilson@email.com

In [18]:
sales_df.head()

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount
0,1,1,1,2022-02-10 14:30:00,1,79.99
1,2,2,3,2022-02-15 10:15:00,2,39.98
2,3,3,5,2022-02-20 16:45:00,1,34.99
3,4,4,2,2022-02-25 11:20:00,3,74.97
4,5,5,4,2022-03-01 13:10:00,1,89.99

In [8]:

# Display basic information about what we've loaded
# len() gives us the number of rows in each DataFrame
print(f"‚úÖ Successfully loaded:")
print(f"   - {len(customers_df)} customers")      # Total number of customer records
print(f"   - {len(products_df)} products")        # Total number of products in catalog
print(f"   - {len(sales_df)} sales transactions") # Total number of sales transactions

‚úÖ Successfully loaded:
   - 100 customers
   - 60 products
   - 150 sales transactions

In [9]:
# Display the first few rows of each dataset to understand the structure
# .head(n) shows the first n rows of a DataFrame - useful for data exploration
print(f"\nüëÄ First few rows of each dataset:")
print(f"\nCustomers:")
print(customers_df.head(3))  # Show first 3 rows of customer data
print(f"\nProducts:")
print(products_df.head(3))   # Show first 3 rows of product data
print(f"\nSales:")
print(sales_df.head(3))      # Show first 3 rows of sales dat

üëÄ First few rows of each dataset:

Customers:
   customer_id first_name last_name  age state  income registration_date  \
0            1       John     Smith   34    CA   75000        2022-01-15
1            2      Sarah   Johnson   28    NY   82000        2022-01-22
2            3    Michael     Brown   45    TX   95000        2022-02-03

                     email
0     john.smith@email.com
1  sarah.johnson@email.com
2  michael.brown@email.com

Products:
   product_id                   product_name       category  price  \
0           1  Wireless Bluetooth Headphones    Electronics  79.99
1           2         Organic Cotton T-Shirt       Clothing  24.99
2           3   Stainless Steel Water Bottle  Home & Garden  19.99

  launch_date      brand
0  2021-03-15  AudioTech
1  2021-04-20    EcoWear
2  2021-05-10  HydroLife

Sales:
   sale_id  customer_id  product_id     transaction_date  quantity  \
0        1            1           1  2022-02-10 14:30:00         1
1        2            2           3  2022-02-15 10:15:00         2
2        3            3           5  2022-02-20 16:45:00         1

   total_amount
0         79.99
1         39.98
2         34.99

In [27]:
# Find the busiest day of the week for sales (by counting transactions)
# Determine which month had the most transactions
# Count how many sales happened in each year

# Extract useful components from datetime objects using the .dt accessor


# The .dt accessor gives us access to datetime-specific methods and properties
print("\nExtracting datetime components...")   

# is the transcation column in a date/ time format
sales_df["transaction_date"]=pd.to_datetime(sales_df["transaction_date"], errors="coerce")

# Extract year (2022, 2023, etc.)
sales_df["year"] = sales_df["transaction_date"].dt.year

# Extract month number (1-12)
sales_df["month"] = sales_df["transaction_date"].dt.month

# Day of week (Monday=0, Sunday=6)
sales_df["day of week"] = sales_df["transaction_date"].dt.month 

# Day name as text (Monday, Tuesday, etc.)
sales_df["day name"] = sales_df["transaction_date"].dt.day_name()

print("‚úÖ Extracted: year, month, day of week, and day name")

Extracting datetime components...
‚úÖ Extracted: year, month, day of week, and day name

In [28]:
# check new columns are there
sales_df.head()

,sale_id,customer_id,product_id,transaction_date,quantity,total_amount,year,month,day of week,day name
0,1,1,1,2022-02-10 14:30:00,1,79.99,2022,2,2,Thursday
1,2,2,3,2022-02-15 10:15:00,2,39.98,2022,2,2,Tuesday
2,3,3,5,2022-02-20 16:45:00,1,34.99,2022,2,2,Sunday
3,4,4,2,2022-02-25 11:20:00,3,74.97,2022,2,2,Friday
4,5,5,4,2022-03-01 13:10:00,1,89.99,2022,3,3,Tuesday

In [30]:
# busiest day of the week
sales_df["day name"].value_counts()
# Friday is the busiest day of the week

day name
Friday       24
Tuesday      22
Thursday     21
Sunday       21
Saturday     21
Wednesday    21
Monday       20
Name: count, dtype: int64

In [31]:
# month with highest transaction
sales_df["month"].value_counts().sort_index()
# february is the month with most transaction aka busiest month overall for all years

month
1     10
2     16
3     14
4     12
5     12
6     12
7     12
8     12
9     12
10    12
11    12
12    14
Name: count, dtype: int64

In [33]:
# month with highest Transaction per year
monthly_counts = sales_df.groupby(["year", "month"]).size().reset_index(name="transactions")

# For each year, find the month with the most # of transactions
max_months_per_year = monthly_counts.loc[
    monthly_counts.groupby("year")["transactions"].idxmax()
]

# Display
max_months_per_year

    year  month  transactions
10  2022     12             7
22  2023     12             7
24  2024      2             6

In [32]:
#sales per year
sales_df["year"].value_counts()
# most sales transactions happened in 2023

year
2023    72
2022    65
2024    13
Name: count, dtype: int64

In [35]:
# Find the date range of our sales data by using min() and max()
# This helps us understand the time span our analysis covers
# the date range of sale_df via min and max functions to see timespan

print("Date Range of Sales Data:")
print("First sale:", sales_df["transaction_date"].min())
print("Latest sale:", sales_df["transaction_date"].max())
print("\nüîç 1.2 Basic Time Analysis")

Date Range of Sales Data:
First sale: 2022-02-10 14:30:00
Latest sale: 2024-03-05 10:30:00

üîç 1.2 Basic Time Analysis

In [36]:
# Find the busiest day of the week by counting transactions
# .value_counts() counts occurrences of each unique value
# Count transactions for each day name   
# Get the day with most transactions (first in sorted list)        
# Get the count for that day
# Display all days ranked by transaction count for complete picture

# YOUR CODE HERE
# count each transcation for each day name
day_counts =sales_df["day name"].value_counts()

# Get the day with most transactions (first in sorted list) 
busiest_day = day_counts.idxmax()

# Get the count for that day
busiest_day_count = day_counts.max()

# Display results
print("Busiest Day of the Week:")
print(f"The busiest day is {busiest_day} with {busiest_day_count} transactions.\n")

# 5. Show all days sorted by transaction count
print("Full traffic of Days by Transaction Count:")
print(day_counts)

Busiest Day of the Week:
The busiest day is Friday with 24 transactions.

Full traffic of Days by Transaction Count:
day name
Friday       24
Tuesday      22
Thursday     21
Sunday       21
Saturday     21
Wednesday    21
Monday       20
Name: count, dtype: int64

In [38]:
# Count sales by year to see yearly trends   
# Count transactions by year, sort chronologically
print(f"\nSales by year:")
# YOUR CODE HERE

# Count transactions by year & sort in chronological order
sales_by_year = sales_df["year"].value_counts().sort_index()

#display 
sales_by_year
# higest sales year is 2023 with a sharp decline in 2024

Sales by year:

year
2022    65
2023    72
2024    13
Name: count, dtype: int64

In [ ]:
# =============================================================================
# PART 2: GROUPBY AND AGGREGATION
# =============================================================================
# GroupBy operations allow us to split data into groups and perform calculations
# on each group separately. This is essential for analyzing patterns and trends.

In [42]:
# Group products by category and calculate average price for each category
# .groupby() splits the data into groups based on the 'category' column
# .mean() calculates the average for each group
# .round(2) rounds to 2 decimal places for currency formatting
# .sort_values(ascending=False) sorts from highest to lowest price
# Loop through each category and its average price             
# Format with dollar sign
# YOUR CODE HERE

# Group products by category and calculate average price
avg_price_by_category = (
    products_df.groupby("category")["price"]
    .mean()
    .round(2)
    .sort_values(ascending=False)
)

# Build a formatted results list (instead of printing)
cat_price_results = [
    f"{category}: ${avg_price:.2f}"
    for category, avg_price in avg_price_by_category.items()
]
# show results
cat_price_results

['Sports & Outdoors: $105.90',
 'Electronics: $59.99',
 'Clothing: $52.24',
 'Accessories: $35.07',
 'Home & Garden: $30.16']

In [43]:
# Count how many products exist in each category
# .value_counts() counts occurrences of each unique category
# YOUR CODE HERE

category_counts = products_df["category"].value_counts().sort_index()

category_counts

category
Accessories          12
Clothing             12
Electronics          13
Home & Garden        12
Sports & Outdoors    11
Name: count, dtype: int64

In [44]:
# Group customers by state and calculate average age
# This shows us the demographic profile of customers in different regions
# YOUR CODE HERE

# Group customers by state and calculate average age
avg_age_by_state = (
    customers_df.groupby("state")["age"]
    .mean()
    .round(1)
    .reset_index(name="avg_age")
)

# Show results 
avg_age_by_state

  state  avg_age
0    CA     34.1
1    FL     39.0
2    IL     37.2
3    NY     36.5
4    TX     38.3

In [47]:
# Find customers with the most purchases (transaction frequency)
# .groupby().size() counts the number of transactions per customer
# This is different from sum() - it counts rows, not values
# Customer ID with most purchases
# Number of purchases by top customer
# YOUR CODE HERE

# Count number of purchases per customer
purchase_counts = (
    sales_df.groupby("customer_id")
    .size()
    .sort_values(ascending=False)
    .reset_index(name="purchase_count")
)

purchase_counts

    customer_id  purchase_count
0             1               2
1            32               2
2            34               2
3            35               2
4            36               2
..          ...             ...
85           65               1
86           64               1
87           63               1
88           62               1
89           90               1

[90 rows x 2 columns]

In [49]:
# Show top 5 customers by number of purchases

# Top 5 customers
top_5 = purchase_counts.head(5)

#display results
top_5

   customer_id  purchase_count
0            1               2
1           32               2
2           34               2
3           35               2
4           36               2

In [50]:
# Calculate total sales revenue by month
# Group sales by month and sum the total_amount for each month

# Calculate the total sales revenue $ by month
monthly_revenue = (
    sales_df.groupby("month")["total_amount"]
    .sum()
    .reset_index()
    .sort_values("month")
)

# show results
monthly_revenue

    month  total_amount
0       1        864.79
1       2       1669.66
2       3       1115.77
3       4        924.77
4       5       1177.79
5       6        986.68
6       7        930.80
7       8        870.74
8       9       1150.76
9      10       1235.80
10     11       1022.76
11     12       1458.71

In [51]:
# Calculate average transaction amount by day of week
# This shows us if people spend more on certain days
# Reorder by actual day order (Monday first) instead of alphabetical

# Calculate average transaction amount by day of week
avg_by_day = (
    sales_df.groupby("day name")["total_amount"]
    .mean()
    .reindex(["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"])
)

# display results 
avg_by_day

day name
Monday        90.927500
Tuesday       74.028636
Wednesday     96.071905
Thursday     102.267619
Friday       100.940833
Saturday      61.121905
Sunday        99.551429
Name: total_amount, dtype: float64

In [56]:
# PART 3: Basic Data Insights
# =============================================================================
# Find which state has the most customers
# Identify the top 5 customers by total spending
# Determine which day of the week has the highest average transaction value

# Which state has the most customers?
state_counts = customers_df["state"].value_counts()

# display results
state_counts

state
CA    20
NY    20
TX    20
FL    20
IL    20
Name: count, dtype: int64

In [55]:
# Top 5 customers by total spending aka total amount 

# get the Sum of total amount per customer
customer_spending = (
    sales_df.groupby("customer_id")["total_amount"]
    .sum()
    .sort_values(ascending=False)
    .reset_index(name="total_spent")
)

#  Show top 5 customers by spending
customer_spending.head(5)

   customer_id  total_spent
0           31       379.97
1           13       359.96
2           41       329.98
3           84       319.98
4           30       284.98

In [54]:
# Get the average transaction amount by day of the week
avg_by_day = (
    sales_df.groupby("day name")["total_amount"]
    .mean()
    .reindex(["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"])
    .dropna()
    .round(2)
)

#display results
avg_by_day
# Thursday has the highest average transaction value

day name
Monday        90.93
Tuesday       74.03
Wednesday     96.07
Thursday     102.27
Friday       100.94
Saturday      61.12
Sunday        99.55
Name: total_amount, dtype: float64